from PIL import Image

import numpy as np
import wordcloud
import settings

keywords = ['师父', '八戒', '菩萨', '唐僧', '和尚', '沙僧', '弟子', '铁棒', '老者', '毫毛', '长老', '道士', '徒弟', '玉帝', '土地', '妖魔', '宝贝', '扇子', '神仙', '老爷', '罗刹', '葫芦', '太子', '道人', '怪物', '手段', '兄弟', '妖王', '樵子', '天尊', '樵夫', '师徒', '寿星', '僧道', '老妖', '祭赛', '李天王', '仙女', '巡山', '兵器', '父母', '国王', '寒光', '大众', '长生', '灵感', '烦恼', '芭蕉扇', '金箍棒', '耳朵', '嫂嫂', '儿子', '贤弟', '下界', '佛祖', '猿猴', '老实', '宝剑', '那道士', '孩儿', '童子', '狮子', '方便', '老道', '模样', '保唐僧', '老弟', '老怪', '天神', '谢恩', '衣服', '潮音', '僧人', '尊师', '武艺', '父子', '降妖', '洞口', '慈悲', '人间', '仙童', '人氏', '世界', '法名', '驾云', '观音菩萨', '行孙', '锡杖', '大雪', '行囊', '马蹄', '通天河', '陈澄', '火光', '铁扇', '儿女', '家人', '蟠桃', '凶神', '王母', '洞天', '妖猴', '法儿', '夯货', '石头', '妖道', '沙和尚', '罗汉', '老君', '口诀', '性命', '狮精', '竹节', '金光', '祸事', '母亲', '芭蕉', '把门', '林子里', '女怪', '不羞', '陛下', '小儿', '石屏', '众神', '女子', '沙滩', '黄花', '水面', '归顺', '惠岸', '先生', '乱筑', '肚里', '冷笑', '老和尚', '天地', '僧官', '孤拐', '合掌', '汉子', '女童', '公主', '女儿', '银子', '舍弟', '列位', '大桃', '定身法', '仙酒', '力士', '正果', '影神', '老猪', '大哥', '银角', '化斋', '包袱', '天兵', '咒语', '筋斗', '猿啼', '花果山', '大胆', '天光', '言语', '后门', '松树', '众僧', '弟兄', '白泽', '径入', '阎王', '人果', '珍羞', '老兄', '年老', '仙气', '惊动', '奶奶', '暗想', '干净', '孽畜', '国丈', '化作', '将身', '父王', '三昧', '何干', '香火', '那话儿', '筋斗云', '原身', '皇帝', '行李', '那长老']

txt = ' '.join(keywords)
background = np.array(Image.open('./src/孙悟空.png'))
w = wordcloud.WordCloud(background_color="white",
                    font_path=settings.FONT_PATH, 
                    width=240, height=600,
                    max_words=2000, mask=background)
w.generate(txt)
w.to_file(f"pywcloud.png")